app/views/users/index.html.erb

<% @users.each do |user| %>
  <%= link_to user.name, user_path(user) %> | <%= user.appointments.count %> appointments
---
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."user_id" = ?  [["user_id", 1]]