app/views/users/show.html.erb

<% count = 1 %>
<% @user.appointments.each do |appointment| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = ?  [["user_id", 14]]