app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @appointment = Appointment.find(params[:id])

INSERT INTO "appointments" ("date", "time", "user_id", "equipment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "12-14-20"], ["time", "6:00pm"], ["user_id", 14], ["equipment_id", 27], ["created_at", "2020-12-14 18:45:47.552801"], ["updated_at", "2020-12-14 18:45:47.552801"]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jerry Smith"], ["created_at", "2020-12-14 18:01:15.545345"], ["updated_at", "2020-12-14 18:01:15.545345"]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Andres"], ["LIMIT", 1]]
INSERT INTO "appointments" ("date", "time", "user_id", "equipment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "12-14-20"], ["time", "8:00pm"], ["user_id", 14], ["equipment_id", 34], ["created_at", "2020-12-14 21:34:17.090576"], ["updated_at", "2020-12-14 21:34:17.090576"]]
---
  def create
    user = User.find_or_create_by(name: appointment_params[:user_name])

    @appointment = user.appointments.build(appointment_params)

    if @appointment.save

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def edit
    @appointment = Appointment.find(params[:id])

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def update
    @appointment = Appointment.find(params[:id])

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 6]]
---
  def destroy
    @appointment = Appointment.find(params[:id])
    user = @appointment.user
    @appointment.destroy