app/models/appointment.rb

  def user_name=(name)
    self.user = User.find_or_create_by(name: name)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Andres"], ["LIMIT", 1]]