app/views/appointments/edit.html.erb

SELECT "equipment".* FROM "equipment"
---
  <br />
  <%= f.collection_select :equipment_id, Equipment.all, :id, :name %>