app/views/appointments/new.html.erb

  <datalist id="users_autocomplete">
    <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"

  <%= f.label :equipment_to_use %>
  <%= f.collection_select :equipment_id, Equipment.all, :id, :name %>
---
SELECT "equipment".* FROM "equipment"